# **Penn State Deloitte Datathon**


#### **Cracking the Case with Deloitte Consulting** 

#### Objective:
To leverge data provided by deloitte of the 3 cities to find a sutiable market to deploy a ride sharing service.

In [ ]:
# importing pakages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
# mount drive
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
# list of datasets in the folder in drive
!ls drive/'My Drive'/Deloitte_Datathon

Denver-Consumer.csv    Miami-Consumer.data.csv	Portland-Consumer-Data.csv
Denver-Rider-Data.csv  Miami-Rider-Data.csv	Portland-Rider-Data.csv

## **Cleaning Data**

### Denver Data

In [ ]:
# creating path
path_dc = "/content/drive/My Drive/Deloitte_Datathon/Denver-Consumer.csv"

In [ ]:
# Denver-Consumer data
denver_consumer = pd.read_csv(path_dc)
denver_consumer.head(5)

  first_name  last_name  ... Distance to work (in miles) Living Situation
0   Merralee   Fielding  ...                       22.62            House
1     Marcel  Moorcraft  ...                       16.95        Townhouse
2     Conant   Daventry  ...                       15.50              NaN
3  Rosalinde     Ruffli  ...                       17.85              NaN
4       Walt   Tibbotts  ...                       19.70        Townhouse

[5 rows x 12 columns]

In [ ]:
denver_consumer.size

1050000

In [ ]:
denver_consumer.dropna(inplace = True)
print(denver_consumer.size)

783984

In [ ]:
denver_consumer.head(5)

  first_name last_name  ... Distance to work (in miles) Living Situation
0   Merralee  Fielding  ...                       22.62            House
5  Kristofor     Gudde  ...                       21.96           Studio
6      Dulci       Lys  ...                       13.29            House
7     Kalina   Ebourne  ...                       16.23        Apartment
8     Marlow  Berridge  ...                       32.89           Studio

[5 rows x 12 columns]

In [ ]:
denver_consumer.drop(["Employee Number", "Company"], axis = 1, inplace = True)
denver_consumer.head(3)

  first_name last_name  ... Distance to work (in miles) Living Situation
0   Merralee  Fielding  ...                       22.62            House
5  Kristofor     Gudde  ...                       21.96           Studio
6      Dulci       Lys  ...                       13.29            House

[3 rows x 10 columns]

In [ ]:
path_rd = "/content/drive/My Drive/Deloitte_Datathon/Denver-Rider-Data.csv"

In [ ]:
denver_rider = pd.read_csv(path_rd)
denver_rider.tail(5)

      Rider First Name Rider Last Name  ...  Car Year         Vin Number
99995        Bernadine        MacDowal  ...      2007  WAUJC68E65A960548
99996       Christiana          Downey  ...      2011  WBAWL13558P033316
99997            Karil            Haps  ...      2004  JN1CV6FE3FM577551
99998          Margret          Diggin  ...      2007  1FMNE1BW8AD805004
99999         Jannelle            Cock  ...      2008  WAUDK78T89A391549

[5 rows x 11 columns]

In [ ]:
denver_rider.Vendor.unique()
denver_rider[denver_rider['Vendor'] == 'Uber']

      Rider First Name Rider Last Name  ...  Car Year Vin Number
43071         Clayborn       Cutsforth  ...      2011        NaN
43072           Helene          Bowyer  ...      1996        NaN
43073             Risa        Wethered  ...      2000        NaN
43074           Kettie       Bultitude  ...      2009        NaN
43075           Ashton        Corinton  ...      2012        NaN
...                ...             ...  ...       ...        ...
71498        Aristotle         Quarmby  ...      2002        NaN
71499          Desiree         Heinish  ...      2011        NaN
71500         Adelaide           Shave  ...      2000        NaN
71501           Sascha      Williamson  ...      1995        NaN
71502           Grange        Chrystie  ...      1988        NaN

[28432 rows x 11 columns]

In [ ]:
denver_rider.size

1100000

In [ ]:
denver_rider_new = denver_rider[["Vendor", "Trip Distance (in Miles)", "Trip Cost", "Trip Time (in Minutes)"]]
denver_rider_new.head(5)

  Vendor  Trip Distance (in Miles) Trip Cost  Trip Time (in Minutes)
0   Taxi                     22.62   $10.93                    39.00
1   Taxi                     16.95   $21.19                    29.23
2   Taxi                     15.50   $36.07                    26.73
3   Taxi                     17.85   $30.06                    30.78
4   Taxi                     19.70   $26.83                    33.97

In [ ]:
denver_rider_new.Vendor.unique()

array(['Taxi', 'Uber', 'Lyft'], dtype=object)

In [ ]:
from google.colab import files
denver_rider_new.to_csv('denver_rider.csv', sep='\t')
files.download('denver_rider.csv')

In [ ]:
denver_consumer.dropna(inplace = True)

In [ ]:
denver_consumer.head(5)

  first_name last_name  ... Distance to work (in miles) Living Situation
0   Merralee  Fielding  ...                       22.62            House
5  Kristofor     Gudde  ...                       21.96           Studio
6      Dulci       Lys  ...                       13.29            House
7     Kalina   Ebourne  ...                       16.23        Apartment
8     Marlow  Berridge  ...                       32.89           Studio

[5 rows x 10 columns]

In [ ]:
from google.colab import files
denver_consumer.to_csv('denver_consumer.csv', sep='\t')
files.download('denver_consumer.csv')

### Miami Data

In [ ]:
path_miami_cons = "/content/drive/My Drive/Deloitte_Datathon/Miami-Consumer.data.csv"

In [ ]:
path_miami_rider = "/content/drive/My Drive/Deloitte_Datathon/Miami-Rider-Data.csv"

In [ ]:
miami_consumer = pd.read_csv(path_miami_cons)
miami_consumer.head(5)

  first_name  last_name  ... Distance to work (in miles) Living Situation
0      Hinze       Ryce  ...                        3.13        Apartment
1       Darb    Taylder  ...                        5.49        Apartment
2   Raphaela    Brimman  ...                        5.81        Apartment
3    Kinsley   Arnaudin  ...                        7.06           Studio
4     Tomaso  Longhirst  ...                        8.65        Townhouse

[5 rows x 12 columns]

In [ ]:
miami_consumer.dropna(inplace = True)
miami_consumer.drop(["Company", "Employee Number"], axis = 1, inplace = True)
miami_consumer.head(5)

  first_name  last_name  ... Distance to work (in miles) Living Situation
1       Darb    Taylder  ...                        5.49        Apartment
2   Raphaela    Brimman  ...                        5.81        Apartment
3    Kinsley   Arnaudin  ...                        7.06           Studio
4     Tomaso  Longhirst  ...                        8.65        Townhouse
5    Stavros   Renowden  ...                        5.36        Apartment

[5 rows x 10 columns]

In [ ]:
from google.colab import files
miami_consumer.to_csv('miami_consumer.csv', sep='\t')
files.download('miami_consumer.csv')

In [ ]:
miami_rider = pd.read_csv(path_miami_rider)
miami_rider.head(5)

  Rider First Name Rider Last Name  ...  Car Year         Vin Number
0             Elie       Tonkinson  ...      2008  1NXBU4EE6AZ577601
1            Bucky          Roffey  ...      2001  WAUAFAFHXAN451380
2              Wit          Jarred  ...      1993  JN1AZ4EH4AM933767
3           Arthur        Giacoppo  ...      2013  WAUHF78P66A034018
4           Alexio         Casolla  ...      2005  WBA3C1C52CA075621

[5 rows x 11 columns]

In [ ]:
miami_rider_new = miami_rider[["Vendor", "Trip Distance (in Miles)", "Trip Cost", "Trip Time (in Minutes)"]]
miami_rider_new.head(5)

  Vendor  Trip Distance (in Miles) Trip Cost  Trip Time (in Minutes)
0   Taxi                     15.42   $35.44                    26.59
1   Taxi                     19.92   $54.07                    34.36
2   Taxi                     15.33   $52.69                    26.44
3   Taxi                     20.84   $36.35                    35.93
4   Taxi                     12.33   $37.29                    21.27

In [ ]:
from google.colab import files
miami_rider_new.to_csv('miami_rider.csv', sep='\t')
files.download('miami_rider.csv')

### Portland Data

In [ ]:
path_pc = "/content/drive/My Drive/Deloitte_Datathon/Portland-Consumer-Data.csv"

In [ ]:
path_pr = "/content/drive/My Drive/Deloitte_Datathon/Portland-Rider-Data.csv"

In [ ]:
portland_consumer = pd.read_csv(path_pc)
portland_consumer.head(5)

  first_name    last_name  ... Distance to work (in miles) Living Situation
0     Peadar       Miguet  ...                        5.13        Apartment
1     Neddie  Beningfield  ...                        7.49           Studio
2      Ardys       Leggat  ...                        7.81           Studio
3     Aurora       Pendre  ...                        9.06            House
4     Vernen   Collumbine  ...                       10.65            House

[5 rows x 12 columns]

In [ ]:
portland_consumer.dropna(inplace = True)
portland_consumer.drop(["Company", "Employee Number"], axis = 1, inplace = True)
portland_consumer.head(5)

  first_name    last_name  ... Distance to work (in miles) Living Situation
1     Neddie  Beningfield  ...                        7.49           Studio
3     Aurora       Pendre  ...                        9.06            House
4     Vernen   Collumbine  ...                       10.65            House
5      Erwin  Littlejohns  ...                        7.36           Studio
7       Iggy     Shirrell  ...                        4.89            House

[5 rows x 10 columns]

In [ ]:
from google.colab import files
portland_consumer.to_csv('portland_consumer.csv', sep='\t')
files.download('portland_consumer.csv')

In [ ]:
portland_rider = pd.read_csv(path_pr)
portland_rider.head(5)

  Rider First Name Rider Last Name  ...  Car Year         Vin Number
0         Jerrilyn         Durbann  ...      1993  1FTEW1C88FF099164
1         Farleigh          Sirett  ...      2006  1G4GJ5E38DF168060
2          Georges           Edson  ...      2001  WBAKX8C5XCC474452
3            Josey        Dumblton  ...      1998  WAUDH78E86A069330
4          Bendite           Cherm  ...      1999  WA1LMAFE6BD775144

[5 rows x 11 columns]

In [ ]:
portland_rider_new = portland_rider[["Vendor", "Trip Distance (in Miles)", "Trip Cost", "Trip Time (in Minutes)"]]
portland_rider_new.head(5)

  Vendor  Trip Distance (in Miles) Trip Cost  Trip Time (in Minutes)
0   Taxi                     12.39    $10.26                   21.37
1   Taxi                     12.79     $6.94                   22.06
2   Taxi                     20.83    $21.50                   35.92
3   Taxi                     14.49    $18.30                   24.99
4   Taxi                     18.25    $10.39                   31.47

In [ ]:
from google.colab import files
portland_rider_new.to_csv('portland_rider.csv', sep='\t')
files.download('portland_rider.csv')

## EDA

In [ ]:
denver_consumer.head(3)

  first_name last_name  ... Distance to work (in miles) Living Situation
0   Merralee  Fielding  ...                       22.62            House
5  Kristofor     Gudde  ...                       21.96           Studio
6      Dulci       Lys  ...                       13.29            House

[3 rows x 10 columns]

In [ ]:
dist_living = denver_consumer[["Distance to work (in miles)", "Living Situation"]].groupby("Living Situation").sum("Distance to work (in miles)")

In [ ]:
dist_living.head(5)

                  Distance to work (in miles)
Living Situation
Apartment                           277880.68
House                               277281.19
Studio                              279037.33
Townhouse                           281144.15